Svirusx/Nethunter-Kernel-S20_FE_5G/drivers/input/keyboard/stm/stm32l0/stm32_pogo_i2c.c
/******************** (C) COPYRIGHT 2019 Samsung Electronics ********************
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License version 2 as
 * published by the Free Software Foundation.
 *
 * THE PRESENT SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES
 * OR CONDITIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED, FOR THE SOLE
 * PURPOSE TO SUPPORT YOUR APPLICATION DEVELOPMENT.
 * AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY DIRECT,
 * INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE
 * CONTENT OF SUCH SOFTWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING
 * INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
 *
 * THIS SOFTWARE IS SPECIFICALLY DESIGNED FOR EXCLUSIVE USE WITH ST PARTS.
 *******************************************************************************/

#include "stm32_pogo_i2c.h"

static struct stm32_pogo_notifier pogo_notifier;

struct stm32_tc_resolution g_tc_resolution;

void pogo_get_tc_resolution(int *x, int *y)
{
	*x = g_tc_resolution.x;
	*y = g_tc_resolution.y;
}
EXPORT_SYMBOL(pogo_get_tc_resolution);

static void pogo_set_conn_state(int state)
{
	if (state)
		pogo_notifier.conn = POGO_NOTIFIER_ID_ATTACHED;
	else
		pogo_notifier.conn = POGO_NOTIFIER_ID_DETACHED;
	pr_info("%s: 0x%02X\n", __func__, pogo_notifier.conn);
}

void stm32_delay(int ms)
{
	if (ms > 20)
		msleep(ms);
	else
		usleep_range(ms * 1000, ms * 1000);
}

static void stm32_print_info(struct stm32_dev *stm32)
{
	struct irq_desc *desc = irq_to_desc(stm32->dev_irq);

	input_info(true, &stm32->client->dev, "mcu_fw(bin):%x, mcu_fw(ic):%x, %s_v%d.%d.%d.%d, "
			"TC_v%02X%02X.%X, con:%d/%d, int:%d, depth:%d, rst:%d, hall:%d\n",
			stm32->mdata.phone_ver[3], stm32->mdata.ic_ver[3], stm32->dtdata->model_name,
			stm32->ic_fw_ver.fw_major_ver, stm32->ic_fw_ver.fw_minor_ver,
			stm32->ic_fw_ver.model_id, stm32->ic_fw_ver.hw_rev,
			stm32->tc_fw_ver_of_ic.major_ver, stm32->tc_fw_ver_of_ic.minor_ver,
			stm32->tc_fw_ver_of_ic.data_ver,
			stm32->connect_state, gpio_get_value(stm32->dtdata->gpio_conn),
			gpio_get_value(stm32->dtdata->gpio_int), desc->depth, stm32->reset_count, stm32->hall_closed);
}

static void stm32_print_info_work(struct work_struct *work)
{
	struct stm32_dev *stm32 = container_of(work, struct stm32_dev,
			print_info_work.work);

	stm32_print_info(stm32);
	schedule_delayed_work(&stm32->print_info_work, STM32_PRINT_INFO_DELAY);
}

int pogo_notifier_register(struct notifier_block *nb, notifier_fn_t notifier,
				pogo_notifier_device_t listener)
{
	struct pogo_data_struct send_data;
	int ret = 0;

	pr_info("%s %s %s: listener=%d register\n", SECLOG, STM32_DRV_NAME, __func__, listener);

	SET_POGO_NOTIFIER_BLOCK(nb, notifier, listener);
	ret = blocking_notifier_chain_register(&pogo_notifier.pogo_notifier_call_chain, nb);
	if (ret < 0)
		pr_err("%s %s %s: blocking_notifier_chain_register error(%d)\n",
				SECLOG, STM32_DRV_NAME, __func__, ret);

	send_data.size = 0;
	send_data.data = 0;
	nb->notifier_call(nb, pogo_notifier.conn, &send_data);

	return ret;
}

int pogo_notifier_unregister(struct notifier_block *nb)
{
	int ret = 0;

	pr_info("%s %s %s: listener=%d unregister\n", SECLOG, STM32_DRV_NAME,
		__func__, nb->priority);

	ret = blocking_notifier_chain_unregister(&pogo_notifier.pogo_notifier_call_chain, nb);
	if (ret < 0)
		pr_err("%s %s %s: blocking_notifier_chain_unregister error(%d)\n",
				SECLOG, STM32_DRV_NAME, __func__, ret);
	DESTROY_POGO_NOTIFIER_BLOCK(nb);

	return ret;
}

static int pogo_notifier_notify(struct stm32_dev *stm32, pogo_notifier_id_t notify_id,
					char *data, int len)
{
	int ret = 0;
	struct pogo_data_struct send_data;

	if (stm32->debug_level & STM32_DEBUG_LEVEL_IRQ_DATA_LOG)
		input_info(true, &stm32->client->dev,
				"%s: ID=%d, len=%d\n", __func__, notify_id, len);

	if (len > STM32_MAX_EVENT_SIZE) {
		input_err(true, &stm32->client->dev, "%s: length is too long %d\n",
				__func__, len);
		return -EINVAL;
	}

	if (len > 0 && data && (stm32->debug_level & STM32_DEBUG_LEVEL_IRQ_DATA_LOG)) {
		int i;

		pr_info("%s %s %s: size:%d, ",
			SECLOG, STM32_DRV_NAME, __func__, len);
		for (i = 0; i < len; i++)
			pr_cont("%02X ", data[i]);
		pr_cont("\n");
	}

	send_data.size = len;
	send_data.data = data;

	ret = blocking_notifier_call_chain(&pogo_notifier.pogo_notifier_call_chain,
						notify_id, &send_data);

	switch (ret) {
	case NOTIFY_STOP_MASK:
	case NOTIFY_BAD:
		input_err(true, &stm32->client->dev,
				"%s: notify error occur(0x%x)\n", __func__, ret);
		break;
	case NOTIFY_DONE:
	case NOTIFY_OK:
		input_dbg(false, &stm32->client->dev,
				"%s: notify done(0x%x)\n", __func__, ret);
		break;
	default:
		input_err(true, &stm32->client->dev,
				"%s: notify status unknown(0x%x)\n", __func__, ret);
		break;
	}

	return ret;
}

static int stm32_dev_regulator(struct stm32_dev *device_data, int onoff);
static void stm32_enable_irq(struct stm32_dev *stm32, int enable);

static void stm32_power_reset(struct stm32_dev *stm32)
{
	if (stm32->reset_count < 100000)
		stm32->reset_count++;
	input_err(true, &stm32->client->dev, "%s, %d\n", __func__, stm32->reset_count);

	gpio_direction_output(stm32->dtdata->mcu_nrst, 0);
	stm32_delay(3);
	gpio_direction_output(stm32->dtdata->mcu_nrst, 1);
	stm32_delay(10);
}

int stm32_i2c_read_bulk(struct i2c_client *client, u8 *data, u8 length)
{
	struct stm32_dev *device_data = i2c_get_clientdata(client);
	int ret;
	int retry = 3;
	struct i2c_msg msgs;
	u8 *buf;

	reinit_completion(&device_data->i2c_done);

	if ((!device_data->connect_state) && (client->addr != 0x51) && mutex_is_locked(&device_data->conn_lock)) {
		input_err(true, &client->dev, "%s: not connected\n", __func__);
		complete_all(&device_data->i2c_done);
		return -ENODEV;
	}

	buf = kzalloc(length, GFP_KERNEL);
	if (!buf) {
		complete_all(&device_data->i2c_done);
		return -ENOMEM;
	}

	msgs.addr = client->addr;
	msgs.flags = client->flags | I2C_M_RD | I2C_M_DMA_SAFE;;
	msgs.len = length;
	msgs.buf = buf;

	while (retry--) {
		ret = i2c_transfer(client->adapter, &msgs, 1);
		if (ret != 1) {
			pogo_notifier_notify(device_data, POGO_NOTIFIER_ID_RESET, 0, 0);
			input_err(true, &client->dev, "scl:%d, sda:%d, int:%d\n",
					gpio_get_value(device_data->dtdata->gpio_scl),
					gpio_get_value(device_data->dtdata->gpio_sda),
					gpio_get_value(device_data->dtdata->gpio_int));
			ret = -EIO;
			stm32_delay(10);
			if ((!device_data->connect_state) && (client->addr != 0x51) && mutex_is_locked(&device_data->conn_lock)) {
				input_err(true, &client->dev, "%s: connect_state=%d\n", __func__, device_data->connect_state);
				kfree(buf);
				complete_all(&device_data->i2c_done);
				return ret;
			}
			continue;
		}
		break;
	}

	if (device_data->debug_level & STM32_DEBUG_LEVEL_I2C_LOG) {
		int i;

		pr_info("%s %s: ", SECLOG, __func__);
		for (i = 0; i < length; i++)
			pr_cont("%02X ", buf[i]);
		pr_cont("\n");
	}

	memcpy(data, buf, length);

