Svirusx/Nethunter-Kernel-S20_FE_5G/drivers/input/keyboard/stm/stm32l0/stm32_pogo_i2c.c
	kfree(buf);
	if ((ret < 0) && (client->addr != 0x51)) 
		stm32_power_reset(device_data);

	complete_all(&device_data->i2c_done);
	return ret;
}

int stm32_i2c_write_burst(struct i2c_client *client, u8 *data, int len)
{
	struct stm32_dev *device_data = i2c_get_clientdata(client);
	int ret;
	int retry = 3;
	u8 *buf;
	reinit_completion(&device_data->i2c_done);

	if ((!device_data->connect_state) && (client->addr != 0x51) && mutex_is_locked(&device_data->conn_lock)) {
		input_err(true, &client->dev, "%s: not connected\n", __func__);
		complete_all(&device_data->i2c_done);
		return -ENODEV;
	}

	if (len > STM32_DEV_FW_UPDATE_PACKET_SIZE) {
		input_err(true, &client->dev,
				"%s: The i2c buffer size is exceeded.\n", __func__);
		complete_all(&device_data->i2c_done);
		return -ENOMEM;
	}

	buf = kzalloc(len, GFP_KERNEL);
	if (!buf) {
		complete_all(&device_data->i2c_done);
		return -ENOMEM;
	}

	memcpy(buf, data, len);

	for (retry = 0; retry < STM32_DEV_I2C_RETRY_CNT; retry++) {
		ret = i2c_master_send_dmasafe(client, buf , len);
		if (ret == len)
			break;

		usleep_range(1 * 1000, 1 * 1000);

		
		if ((!device_data->connect_state) && (client->addr != 0x51) && mutex_is_locked(&device_data->conn_lock)) {
			input_err(true, &client->dev, "%s: connect_state=%d\n", __func__, device_data->connect_state);
			kfree(buf);
			complete_all(&device_data->i2c_done);
			return ret;
		}

		if (retry > 1)
			input_err(true, &client->dev, "%s: I2C retry %d, ret:%d\n", __func__, retry + 1, ret);
	}

	if (retry == STM32_DEV_I2C_RETRY_CNT) {
		input_err(true, &client->dev, "%s: I2C write over retry limit\n", __func__);
		ret = -EIO;
	}

	if (device_data->debug_level & STM32_DEBUG_LEVEL_I2C_LOG) {
		int i;

		pr_info("%s %s: ", SECLOG, __func__);
		for (i = 0; i < len; i++)
			pr_cont("%02X ", buf[i]);
		pr_cont("\n");
	}

	kfree(buf);

	if ((ret < 0) && (client->addr != 0x51))
		stm32_power_reset(device_data);

	complete_all(&device_data->i2c_done);
	
	return ret;
}

static int stm32_i2c_header_write(struct i2c_client *client, u8 ep_id, u16 payload_size)
{
	u8 buff[3] = { 0 };

	payload_size += 3;

	buff[0] = payload_size & 0xFF;
	buff[1] = (payload_size >> 8) & 0xFF;
	buff[2] = ep_id;

	return stm32_i2c_write_burst(client, buff, 3);
}

static int stm32_i2c_reg_write(struct i2c_client *client, u8 ep_id, u8 regaddr)
{
	struct stm32_dev *stm32 = i2c_get_clientdata(client);
	int ret;

	mutex_lock(&stm32->i2c_lock);
	ret = stm32_i2c_header_write(client, ep_id, 1);
	if (ret < 0)
		goto out;

	ret = stm32_i2c_write_burst(client, &regaddr, 1);

out:
	mutex_unlock(&stm32->i2c_lock);
	return ret;
}

static int stm32_i2c_reg_read(struct i2c_client *client, u8 ep_id, u8 regaddr, u16 length, u8 *values)
{
	struct stm32_dev *stm32 = i2c_get_clientdata(client);
	int ret;
	u16 payload_size = 0;
	u8 buff[3] = { 0 };

	mutex_lock(&stm32->i2c_lock);
	ret = stm32_i2c_header_write(client, ep_id, 1);
	if (ret < 0)
		goto out;

	ret = stm32_i2c_write_burst(client, &regaddr, 1);
	if (ret < 0)
		goto out;
	
	ret = stm32_i2c_read_bulk(client, buff, 3);
	if (ret < 0)
		goto out;

	memcpy(&payload_size, buff, 2);
	payload_size -= 3;
	if (payload_size == 0 || payload_size > 0xFF) {
		input_err(true, &client->dev, "wrong value of payload size %d\n", payload_size);
		ret = -EIO;
		goto out;
	}

	if (payload_size > length) {
		input_err(true, &client->dev, "payload size %d is over buff length %d\n",
				payload_size, length);
		ret = -EIO;
		goto out;
	}

	ret = stm32_i2c_read_bulk(client, values, payload_size);
out:
	mutex_unlock(&stm32->i2c_lock);
	return ret;
}

static int stm32_dev_regulator(struct stm32_dev *device_data, int onoff)
{
	struct device *dev = &device_data->client->dev;
	int ret = 0;

	if (IS_ERR_OR_NULL(device_data->dtdata->vdd_vreg))
		return ret;

	if (onoff) {
		if (!regulator_is_enabled(device_data->dtdata->vdd_vreg)) {
			ret = regulator_enable(device_data->dtdata->vdd_vreg);
			if (ret) {
				input_err(true, dev,
						"%s: Failed to enable vddo: %d\n",
						__func__, ret);
				return ret;
			}
		} else {
			input_err(true, dev, "%s: vdd is already enabled\n", __func__);
		}
	} else {
		if (regulator_is_enabled(device_data->dtdata->vdd_vreg)) {
			ret = regulator_disable(device_data->dtdata->vdd_vreg);
			if (ret) {
				input_err(true, dev,
						"%s: Failed to disable vddo: %d\n",
						__func__, ret);
				return ret;
			}
		} else {
			input_err(true, dev, "%s: vdd is already disabled\n", __func__);
		}
	}

	input_err(true, dev, "%s %s: vdd:%s\n", __func__, onoff ? "on" : "off",
			regulator_is_enabled(device_data->dtdata->vdd_vreg) ? "on" : "off");

	return ret;
}

static void stm32_enable_irq(struct stm32_dev *stm32, int enable)
{
	static int depth;

	if (enable != INT_ENABLE && enable != INT_DISABLE_NOSYNC && enable != INT_DISABLE_SYNC)
		return;

	mutex_lock(&stm32->irq_lock);
	if (enable == INT_ENABLE) {
		if (depth) {
			--depth;
			enable_irq(stm32->dev_irq);
			input_info(true, &stm32->client->dev, "%s: enable irq\n", __func__);
		}
	} else {
		if (!depth) {
			++depth;
			if (enable == INT_DISABLE_NOSYNC)
				disable_irq_nosync(stm32->dev_irq);
			else
				disable_irq(stm32->dev_irq);
			input_info(true, &stm32->client->dev, "%s: disable irq %ssync\n",
				__func__, enable == INT_DISABLE_NOSYNC ? "no" : "");
		}
	}
	mutex_unlock(&stm32->irq_lock);
}

static int stm32_read_crc(struct stm32_dev *stm32)
{
	int ret;
	u8 rbuf[4] = { 0 };

	ret = stm32_i2c_reg_read(stm32->client, ID_MCU, STM32_CMD_CHECK_CRC, 4, rbuf);
	if (ret < 0)
		return ret;

	stm32->crc_of_ic = rbuf[3] << 24 | rbuf[2] << 16 | rbuf[1] << 8 | rbuf[0];

	input_info(true, &stm32->client->dev,
			"%s: [IC] BOOT CRC32 = 0x%08X\n", __func__, stm32->crc_of_ic);
	return 0;
}

static int stm32_read_version(struct stm32_dev *stm32)
{
	int ret;
	u8 rbuf[4] = { 0 };

	ret = stm32_i2c_reg_read(stm32->client, ID_MCU, STM32_CMD_CHECK_VERSION, 4, rbuf);
	if (ret < 0)
		return ret;

	stm32->ic_fw_ver.hw_rev = rbuf[0];
	stm32->ic_fw_ver.model_id = rbuf[1];
	stm32->ic_fw_ver.fw_minor_ver = rbuf[2];
	stm32->ic_fw_ver.fw_major_ver = rbuf[3];

	input_info(true, &stm32->client->dev,
			"%s: [IC] version:%d.%d, model_id:%02d, hw_rev:%02d\n",
			__func__, stm32->ic_fw_ver.fw_major_ver, stm32->ic_fw_ver.fw_minor_ver,
			stm32->ic_fw_ver.model_id, stm32->ic_fw_ver.hw_rev);
	return 0;
}

static int stm32_read_tc_resolution(struct stm32_dev *stm32)
{
	int ret;
	u8 rbuf[4] = { 0 };

	ret = stm32_i2c_reg_read(stm32->client, ID_TOUCHPAD, STM32_CMD_GET_TC_RESOLUTION, 4, rbuf);
	if (ret < 0)
		return ret;

	g_tc_resolution.x = rbuf[3] << 8 | rbuf[2];
	g_tc_resolution.y = rbuf[1] << 8 | rbuf[0];

	input_info(true, &stm32->client->dev,
			"%s: x:%d, y:%d\n", __func__, g_tc_resolution.x, g_tc_resolution.y);
	return 0;
}

static int stm32_read_tc_crc(struct stm32_dev *stm32)
{
	int ret;
	u8 rbuf[2] = { 0 };

	ret = stm32_i2c_reg_read(stm32->client, ID_TOUCHPAD, STM32_CMD_GET_TC_FW_CRC16, 2, rbuf);
	if (ret < 0)
		return ret;

	stm32->tc_crc = rbuf[1] << 8 | rbuf[0];

	input_info(true, &stm32->client->dev,
			"%s: [TC IC] CRC = 0x%04X\n", __func__, stm32->tc_crc);
	return 0;
}

static int stm32_read_tc_version(struct stm32_dev *stm32)
{
	int ret;
	u8 rbuf[6] = { 0 };

	ret = stm32_i2c_reg_read(stm32->client, ID_TOUCHPAD, STM32_CMD_GET_TC_FW_VERSION, 6, rbuf);
	if (ret < 0)
		return ret;

	stm32->tc_fw_ver_of_ic.minor_ver = rbuf[5] << 8 | rbuf[4];
	stm32->tc_fw_ver_of_ic.major_ver = rbuf[3] << 8 | rbuf[2];
	stm32->tc_fw_ver_of_ic.data_ver = rbuf[1] << 8 | rbuf[0];

	input_info(true, &stm32->client->dev,
			"%s: [TC IC] version:0x%02X%02X, data ver:0x%X\n",
			__func__, stm32->tc_fw_ver_of_ic.major_ver,
			stm32->tc_fw_ver_of_ic.minor_ver,
			stm32->tc_fw_ver_of_ic.data_ver);
	return 0;
}

u32 stm32_crc32(u8 *src, size_t len) {
	u8 *bp;
	size_t idx;
	u32 crc = 0xFFFFFFFF;

	for (idx = 0; idx < len; idx++) {
		bp = src  + (idx ^ 0x3);
		crc = (crc << 8) ^ crctab[((crc >> 24) ^ *bp) & 0xFF];
	}
	return crc;
}

static void stm32_get_fw_info_of_bin(struct stm32_dev *stm32)
{
	if (!stm32->fw)
		return;

	memcpy(stm32->fw_header, &stm32->fw->data[STM32_FW_APP_CFG_OFFSET],
		sizeof(struct stm32_fw_header));
	stm32->crc_of_bin = stm32_crc32((u8 *)stm32->fw->data, stm32->fw->size);
	
	input_info(true, &stm32->client->dev,
			"%s: [BIN] %s, version:%d.%d, model_id:%d, hw_rev:%d, CRC:0x%X\n",
			__func__, stm32->fw_header->magic_word,
			stm32->fw_header->boot_app_ver.fw_major_ver,
			stm32->fw_header->boot_app_ver.fw_minor_ver,
			stm32->fw_header->boot_app_ver.model_id,
			stm32->fw_header->boot_app_ver.hw_rev, stm32->crc_of_bin);
}

static void stm32_get_tc_fw_info_of_bin(struct stm32_dev *stm32)
{
	if (!stm32->tc_fw)
		return;

	stm32->tc_fw_ver_of_bin.data_ver = (u16)(stm32->tc_fw->data[52] | (stm32->tc_fw->data[53] << 8));
	stm32->tc_fw_ver_of_bin.major_ver = (u16)(stm32->tc_fw->data[56] | (stm32->tc_fw->data[57] << 8));
	stm32->tc_fw_ver_of_bin.minor_ver = (u16)(stm32->tc_fw->data[60] | (stm32->tc_fw->data[61] << 8));

	input_info(true, &stm32->client->dev,
			"%s: [TC BIN] version:0x%02X%02X, data_ver:0x%X\n",
			__func__, stm32->tc_fw_ver_of_bin.major_ver,
			stm32->tc_fw_ver_of_bin.minor_ver,
			stm32->tc_fw_ver_of_bin.data_ver);
}

static int stm32_load_fw_from_fota(struct stm32_dev *stm32, u8 ed_id)
{
	struct firmware *fw;
	struct file *fp;
	mm_segment_t old_fs;
	long fw_size, nread;
	int error = 0;
	char fw_path[128] = { 0 };

