Svirusx/Nethunter-Kernel-S20_FE_5G/drivers/input/keyboard/stm/stm32l0/stm32_pogo_i2c.c
	if (ed_id == ID_MCU) {
		fw = stm32->fw;
	} else if (ed_id == ID_TOUCHPAD) {
		fw = stm32->tc_fw;
	} else {
		input_err(true, &stm32->client->dev, "%s: wrong ed_id %d\n", __func__, ed_id);
		return -EINVAL;
	}

	old_fs = get_fs();
	set_fs(KERNEL_DS);

	snprintf(fw_path, sizeof(fw_path), "%s/%s%s.bin",
			STM32_FOTA_BIN_PATH, stm32->dtdata->model_name,
			ed_id == ID_TOUCHPAD ? "TOUCH" : "");

	input_info(true, &stm32->client->dev, "%s: path:%s\n", __func__, fw_path);

	fp = filp_open(fw_path, O_RDONLY, 0400);
	if (IS_ERR(fp)) {
		input_err(true, &stm32->client->dev, "%s: failed to open fw\n", __func__);
		error = -ENOENT;
		goto err_open;
	}

	fw_size = fp->f_path.dentry->d_inode->i_size;
	if (fw_size <= 0) {
		error = -ENOENT;
		goto err_get_size;
	}

	fw->size = (size_t)fw_size;
	input_info(true, &stm32->client->dev, "%s: size %ld Bytes\n", __func__, fw_size);

	nread = vfs_read(fp, (char __user *)fw->data, fw_size, &fp->f_pos);
	if (nread != fw_size) {
		input_err(true, &stm32->client->dev,
				"%s: failed to read firmware file, nread %ld Bytes\n",
				__func__, nread);
		error = -EIO;
		goto err_get_size;
	}

	if (ed_id == ID_MCU)
		stm32_get_fw_info_of_bin(stm32);
	else if (ed_id == ID_TOUCHPAD)
		stm32_get_tc_fw_info_of_bin(stm32);

err_get_size:
	filp_close(fp, NULL);
err_open:
	set_fs(old_fs);
	return error;
}

static bool stm32_check_fw_update(struct stm32_dev *stm32)
{
	u16 fw_ver_bin, fw_ver_ic;

	if (stm32_read_version(stm32) < 0) {
		input_err(true, &stm32->client->dev, "%s: failed to read version\n", __func__);
		return false;
	}

	if (stm32_read_crc(stm32) < 0) {
		input_err(true, &stm32->client->dev, "%s: failed to read crc\n", __func__);
		return false;
	}

	if (stm32_load_fw_from_fota(stm32, ID_MCU) < 0) {
		input_err(true, &stm32->client->dev, "%s: failed to read bin data\n", __func__);
		return false;
	}

	fw_ver_bin = stm32->fw_header->boot_app_ver.fw_major_ver << 8 |
			stm32->fw_header->boot_app_ver.fw_minor_ver;
	fw_ver_ic = stm32->ic_fw_ver.fw_major_ver << 8 | stm32->ic_fw_ver.fw_minor_ver;

	input_info(true, &stm32->client->dev,
			"%s: [BIN] V:%d.%d CRC:0x%X / [IC] V:%d.%d CRC:0x%X\n",
			__func__, stm32->fw_header->boot_app_ver.fw_major_ver,
			stm32->fw_header->boot_app_ver.fw_minor_ver, stm32->crc_of_bin,
			stm32->ic_fw_ver.fw_major_ver, stm32->ic_fw_ver.fw_minor_ver,
			stm32->crc_of_ic);

	if (strncmp(STM32_MAGIC_WORD, stm32->fw_header->magic_word, 7) != 0) {
		input_info(true, &stm32->client->dev, "%s: binary file is wrong : %s\n",
				__func__, stm32->fw_header->magic_word);
		return false;
	}

	if (0) {//stm32->fw_header->boot_app_ver.model_id != stm32->ic_fw_ver.model_id) {
		input_info(true, &stm32->client->dev,
				"%s: [BIN] %d / [IC] %d : diffrent model id. do not update\n",
				__func__, stm32->fw_header->boot_app_ver.model_id,
				stm32->ic_fw_ver.model_id);
		return false;
	}

	if (fw_ver_bin > fw_ver_ic) {
		input_info(true, &stm32->client->dev, "%s: need to update fw\n", __func__);
		return true;
	} else if (fw_ver_bin == fw_ver_ic && stm32->crc_of_bin != stm32->crc_of_ic) {
		input_err(true, &stm32->client->dev,
				"%s: CRC mismatch! need to update fw\n", __func__);
		return true;
	} else {
		input_info(true, &stm32->client->dev, "%s: skip fw update\n", __func__);
		return false;
	}
}

static int stm32_set_mode(struct stm32_dev *stm32, int mode)
{
	int ret;
	u8 buff;
	u8 cmd;

	if (mode == MODE_APP)
		cmd = STM32_CMD_ABORT;
	else if (mode == MODE_DFU)
		cmd = STM32_CMD_ENTER_DFU_MODE;
	else
		return -EINVAL;

	ret = stm32_i2c_reg_read(stm32->client, ID_MCU, STM32_CMD_GET_MODE, 1, &buff);
	if (ret < 0) {
		input_err(true, &stm32->client->dev,
				"%s: failed to read mode, %d\n", __func__, ret);
		return ret;
	}

	input_info(true, &stm32->client->dev, "[MODE] %d\n", buff);

	if (buff != mode && buff != MODE_EXCEPTION) {
		stm32->hall_flag = false;
		input_info(true, &stm32->client->dev, "%s: enter %s mode\n",
				__func__, mode == MODE_APP ? "APP" : "DFU");
		ret = stm32_i2c_reg_write(stm32->client, ID_MCU, cmd);
	} else if (buff == MODE_EXCEPTION) {
		stm32->hall_flag = true;
	}

	stm32_delay(200);

	return ret;
}

static void stm32_check_ic_work(struct work_struct *work)
{
	struct stm32_dev *stm32 = container_of((struct delayed_work *)work,
			struct stm32_dev, check_ic_work);
	int ret;

	if (!stm32->check_ic_flag) {
		if (stm32->hall_closed) {
			input_info(true, &stm32->client->dev,
					"%s: cover closed or fold backward\n", __func__);
			return;
		}

		ret = stm32_read_version(stm32);
		if (ret < 0) {
			input_err(true, &stm32->client->dev,
				"%s: failed to read version, %d\n", __func__, ret);
			return;
		}
	}

	ret = stm32_set_mode(stm32, MODE_APP);
	if (ret < 0) {
		input_err(true, &stm32->client->dev,
				"%s: failed to set APP mode\n", __func__);
		return;
	}

	if (!stm32->hall_flag) {
		ret = stm32_read_crc(stm32);
		if (ret < 0) {
			input_err(true, &stm32->client->dev,
					"%s: failed to get CRC\n", __func__);
			return;
		}

		ret = stm32_read_tc_version(stm32);
		if (ret < 0) {
			input_err(true, &stm32->client->dev,
					"%s: failed to read TC version\n", __func__);
			return;
		}

		ret = stm32_read_tc_crc(stm32);
		if (ret < 0) {
			input_err(true, &stm32->client->dev,
					"%s: failed to read TC CRC\n", __func__);
			return;
		}

		ret = stm32_read_tc_resolution(stm32);
		if (ret < 0) {
			input_err(true, &stm32->client->dev,
					"%s: failed to read TC resolution\n", __func__);
			return;
		}
	}

	stm32->check_ic_flag = false;
}

static int stm32_dev_kpc_enable(struct stm32_dev *stm32)
{
	stm32_enable_irq(stm32, INT_ENABLE);
	return 0;
}

static void stm32_send_conn_noti(struct stm32_dev *stm32)
{
	char str_conn[16] = { 0 };
	char *event[2] = { str_conn, NULL };

	
	if (stm32->connect_state)
		pogo_notifier_notify(stm32, POGO_NOTIFIER_ID_ATTACHED, 0, 0);
	else
		pogo_notifier_notify(stm32, POGO_NOTIFIER_ID_DETACHED, 0, 0);
	snprintf(str_conn, 16, "CONNECT=%d", stm32->connect_state);
	kobject_uevent_env(&stm32->sec_pogo->kobj, KOBJ_CHANGE, event);
	input_info(true, &stm32->client->dev, "%s: send uevent : %s\n", __func__, event[0]);
}
static void stm32_dev_int_proc(struct stm32_dev *stm32)
{
	int ret = 0;
	u8 event_data[STM32_MAX_EVENT_SIZE] = { 0 };
	u16 payload_size;
	u8 buff[3] = { 0 };

