Svirusx/Nethunter-Kernel-S20_FE_5G/drivers/input/keyboard/stm/stm32l0/stm32_pogo_i2c.c
#ifdef CONFIG_PM_SLEEP
	if (!stm32->resume_done.done) {
		wake_lock_timeout(&stm32->stm_wake_lock, msecs_to_jiffies(3 * MSEC_PER_SEC));
		/* waiting for blsp block resuming, if not occurs i2c error */
		ret = wait_for_completion_interruptible_timeout(&stm32->resume_done,
				msecs_to_jiffies(5 * MSEC_PER_SEC));
		if (ret == 0) {
			input_err(true, &stm32->client->dev,
					"%s: LPM: pm resume is not handled [timeout]\n",
					__func__);
			return;
		}
	}
#endif
	mutex_lock(&stm32->i2c_lock);

	ret = stm32_i2c_header_write(stm32->client, ID_MCU, 0);
	if (ret < 0)
		goto out_i2c_lock;

	ret = stm32_i2c_read_bulk(stm32->client, buff, 3);
	if (ret < 0)
		goto out_i2c_lock;

	memcpy(&payload_size, buff, 2);
	payload_size -= 3;

	if (!payload_size || payload_size > STM32_MAX_EVENT_SIZE) {
		mutex_unlock(&stm32->i2c_lock);
		ret = stm32_read_version(stm32);
		if (ret < 0)
			input_err(true, &stm32->client->dev,
					"%s: failed to read version\n", __func__);
		stm32->check_ic_flag = true;
		schedule_delayed_work(&stm32->check_ic_work, msecs_to_jiffies(10));
		stm32->check_conn_flag = true;
		stm32_send_conn_noti(stm32);
		input_info(true, &stm32->client->dev,"%s: sendconn\n", __func__);
		return;
	}

	ret = stm32_i2c_read_bulk(stm32->client, event_data, payload_size);
	if (ret < 0)
		goto out_i2c_lock;

	/* burst noise & impulse noise */
	if (event_data[0] == 0x03 && event_data[1] == 0x00 && event_data[2] == 0x05)
		goto out_i2c_lock;

	mutex_unlock(&stm32->i2c_lock);

	if (buff[2] > POGO_NOTIFIER_EVENTID_MCU && buff[2] < POGO_NOTIFIER_EVENTID_MAX)
		pogo_notifier_notify(stm32, buff[2], event_data, payload_size);
	else
		input_err(true, &stm32->client->dev,
				"%s: wrong id %d, size %d\n", __func__, buff[2], payload_size);

	/* release all event if hall ic event occured */
	if (buff[2] == POGO_NOTIFIER_EVENTID_HALL) {
		pogo_notifier_notify(stm32, POGO_NOTIFIER_ID_RESET, 0, 0);
		stm32->hall_closed = (event_data[0] != 2);
		if (stm32->hall_flag && !stm32->hall_closed) {
			input_info(true, &stm32->client->dev,
				"%s: hall_flag %d, hall_closed:%d\n", __func__, stm32->hall_flag, stm32->hall_closed);
			schedule_work(&stm32->check_ic_work.work);
			stm32->hall_flag = false;
		}
	}

	return;

out_i2c_lock:
	mutex_unlock(&stm32->i2c_lock);
}

static irqreturn_t stm32_dev_isr(int irq, void *dev_id)
{
	struct stm32_dev *stm32 = (struct stm32_dev *)dev_id;
	int ret = 0;

	if (gpio_get_value(stm32->dtdata->gpio_int))
		return IRQ_HANDLED;

	if (stm32->stm32_bus_perf_client) {
		cancel_delayed_work(&stm32->bus_voting_work);
		if (stm32->voting_flag == STM32_BUS_VOTING_NONE) {
			ret = msm_bus_scale_client_update_request(stm32->stm32_bus_perf_client, STM32_BUS_VOTING_UP);
			if (ret) {
				input_info(true, &stm32->client->dev, "%s: voting failed ret:%d\n", __func__, ret);
			} else {
				input_info(true, &stm32->client->dev, "%s: voting success ret:%d\n", __func__, ret);
				stm32->voting_flag = STM32_BUS_VOTING_UP;
			}
		}
	}

	if (stm32->stm32_bus_perf_client)
		schedule_delayed_work(&stm32->bus_voting_work, msecs_to_jiffies(15000));

	mutex_lock(&stm32->dev_lock);
	stm32_dev_int_proc(stm32);
	mutex_unlock(&stm32->dev_lock);

	return IRQ_HANDLED;
}

#ifdef CONFIG_OF
static int stm32_parse_dt(struct device *dev,
		struct stm32_dev *device_data)
{
	struct device_node *np = dev->of_node;
	int ret;

	device_data->dtdata->gpio_int = of_get_named_gpio(np, "stm32,irq_gpio", 0);
	if (!gpio_is_valid(device_data->dtdata->gpio_int)) {
		input_err(true, dev, "unable to get gpio_int\n");
		return -EIO;
	}

	device_data->dtdata->gpio_sda = of_get_named_gpio(np, "stm32,sda_gpio", 0);
	if (!gpio_is_valid(device_data->dtdata->gpio_sda)) {
		input_err(true, dev, "unable to get gpio_sda\n");
		return -EIO;
	}

	device_data->dtdata->gpio_scl = of_get_named_gpio(np, "stm32,scl_gpio", 0);
	if (!gpio_is_valid(device_data->dtdata->gpio_scl)) {
		input_err(true, dev, "unable to get gpio_scl\n");
		return -EIO;
	}

	device_data->dtdata->gpio_conn = of_get_named_gpio(np, "stm32,irq_conn", 0);
	if (!gpio_is_valid(device_data->dtdata->gpio_conn)) {
		input_err(true, dev, "unable to get irq_conn\n");
		return -EIO;
	}

	device_data->dtdata->mcu_swclk = of_get_named_gpio(np, "stm32,mcu_swclk", 0);
	if (!gpio_is_valid(device_data->dtdata->mcu_swclk)) {
		input_err(true, dev, "unable to get mcu_swclk\n");
		return -EIO;
	}

	
	device_data->dtdata->mcu_nrst = of_get_named_gpio(np, "stm32,mcu_nrst", 0);
	if (!gpio_is_valid(device_data->dtdata->mcu_nrst)) {
		input_err(true, dev, "unable to get mcu_nrst\n");
		return -EIO;
	}

	if (of_property_read_u32(np, "stm32,irq_type", &device_data->dtdata->irq_type)) {
		input_err(true, dev, "%s: Failed to get irq_type property\n", __func__);
		device_data->dtdata->irq_type = IRQF_TRIGGER_LOW | IRQF_ONESHOT;
	} else {
		input_info(true, dev, "%s: irq_type property:%X, %d\n", __func__,
				device_data->dtdata->irq_type, device_data->dtdata->irq_type);
	}

	if (of_property_read_u32(np, "stm32,irq_conn_type", &device_data->dtdata->irq_conn_type)) {
		input_err(true, dev, "%s: Failed to get irq_conn_type property\n", __func__);
		device_data->dtdata->irq_conn_type = IRQF_TRIGGER_FALLING | IRQF_TRIGGER_RISING | IRQF_ONESHOT;
	} else {
		input_info(true, dev, "%s: irq_conn_type property:%X, %d\n", __func__,
				device_data->dtdata->irq_conn_type, device_data->dtdata->irq_conn_type);
	}

	if (of_property_read_bool(np, "stm32_vddo-supply")) {
		device_data->dtdata->vdd_vreg = devm_regulator_get(&device_data->client->dev,
									"stm32_vddo");
		if (IS_ERR(device_data->dtdata->vdd_vreg)) {
			ret = PTR_ERR(device_data->dtdata->vdd_vreg);
			input_err(true, &device_data->client->dev,
					"%s: could not get vddo, rc = %d\n",
					__func__, ret);
			device_data->dtdata->vdd_vreg = NULL;
		}
	} else {
		input_err(true, &device_data->client->dev, "%s: not use regulator\n", __func__);
	}

	ret = of_property_read_string(np, "stm32,model_name", &device_data->dtdata->model_name);
	if (ret) {
		input_err(true, dev, "unable to get model_name\n");
		return ret;
	}

	ret = of_property_read_string(np, "stm32,fw_name", &device_data->dtdata->mcu_fw_name);
	if (ret) {
		input_err(true, dev, "unable to get model_name\n");
		return ret;
	}

	if (of_property_read_u32(np, "stm32,i2c-burstmax", &device_data->dtdata->i2c_burstmax)) {
		input_dbg(false, dev, "%s: Failed to get i2c_burstmax property\n", __func__);
		device_data->dtdata->i2c_burstmax = STM32_MAX_EVENT_SIZE;
	}

	input_info(true, dev, "%s: scl: %d, sda: %d, int:%d, conn: %d, mcu_swclk: %d, mcu_nrst: %d model_name:%s mcu_fw_name:%s i2c-burstmax:%d\n",
			__func__, device_data->dtdata->gpio_scl, device_data->dtdata->gpio_sda,
			device_data->dtdata->gpio_int, device_data->dtdata->gpio_conn, 
			device_data->dtdata->mcu_nrst, device_data->dtdata->mcu_swclk,
			device_data->dtdata->model_name, device_data->dtdata->mcu_fw_name,
			device_data->dtdata->i2c_burstmax);
	return 0;
}
#else
static int stm32_parse_dt(struct device *dev,
		struct stm32_dev *device_data)
{
	return -ENODEV;
}
#endif

static int stm32_keyboard_start(struct stm32_dev *data)
{
	int ret = 0;

	if (!data)
		return -ENODEV;

	ret = stm32_dev_regulator(data, 1);
	if (ret < 0) {
		input_err(true, &data->client->dev, "%s: regulator on error\n", __func__);
		goto out;
	}

	stm32_delay(50);
	ret = stm32_dev_kpc_enable(data);
	if (ret < 0) {
		input_err(true, &data->client->dev, "%s: enable error\n", __func__);
		goto out;
	}

	input_info(true, &data->client->dev, "%s done\n", __func__);
	return 0;
out:
	input_err(true, &data->client->dev, "%s: failed. int:%d, sda:%d, scl:%d\n", __func__,
			gpio_get_value(data->dtdata->gpio_int),
			gpio_get_value(data->dtdata->gpio_sda),
			gpio_get_value(data->dtdata->gpio_scl));

	stm32_enable_irq(data, INT_DISABLE_NOSYNC);

	if (stm32_dev_regulator(data, 0) < 0)
		input_err(true, &data->client->dev, "%s: regulator off error\n", __func__);

	return ret;
}

static int stm32_keyboard_stop(struct stm32_dev *data)
{
	int ret = 0;

	if (!data)
		return -ENODEV;

	stm32_enable_irq(data, INT_DISABLE_NOSYNC);

	ret = stm32_dev_regulator(data, 0);
	if (ret < 0) {
		input_err(true, &data->client->dev, "%s: regulator off error\n", __func__);
		goto out;
	}

out:
	input_info(true, &data->client->dev, "%s: %s\n", __func__, ret < 0 ? "failed" : "done");
	return ret;
}

