Svirusx/Nethunter-Kernel-S20_FE_5G/drivers/input/keyboard/stm/stm32l0/stm32_pogo_i2c.c
static void stm32_keyboard_connect(struct stm32_dev *data)
{
	mutex_lock(&data->dev_lock);

	input_info(true, &data->client->dev, "%s: %d\n", __func__, data->connect_state);
	data->hall_closed = false;

#ifndef CONFIG_SEC_FACTORY
	if (!data->resume_done.done)
		wake_lock_timeout(&data->stm_wake_lock, msecs_to_jiffies(3 * MSEC_PER_SEC));
#endif
	cancel_delayed_work(&data->check_ic_work);

	if (data->connect_state) {
		stm32_keyboard_start(data);
		schedule_delayed_work(&data->check_init_work, 500);
	} else {
		stm32_keyboard_stop(data);
		data->check_conn_flag = false;
	}

	pogo_set_conn_state(data->connect_state);

	if (!data->connect_state)
		cancel_delayed_work(&data->print_info_work);
	else
		schedule_delayed_work(&data->print_info_work, STM32_PRINT_INFO_DELAY);

	mutex_unlock(&data->dev_lock);

}

static void stm32_check_conn_work(struct work_struct *work)
{
	struct stm32_dev *data = container_of(work, struct stm32_dev,
			check_conn_work.work);
	int current_conn_state;

	mutex_lock(&data->conn_lock);
	current_conn_state = gpio_get_value(data->dtdata->gpio_conn);
	input_info(true, &data->client->dev,"%s: con:%d, current:%d\n", __func__,
					data->connect_state, current_conn_state);
	if (data->connect_state) {
		if (!current_conn_state) {
			data->connect_state = current_conn_state;
			stm32_keyboard_connect(data);
			stm32_send_conn_noti(data);
		} else {
			stm32_dev_regulator(data, 1);
		}
	} else {
		 if (current_conn_state) {
			data->connect_state = current_conn_state;
			stm32_keyboard_connect(data);
		}
	}
	mutex_unlock(&data->conn_lock);
}

static void stm32_check_init_work(struct work_struct *work)
{
	struct stm32_dev *data = container_of((struct delayed_work *)work,
			struct stm32_dev, check_init_work);

	if (!data->check_conn_flag) {
		input_info(true, &data->client->dev, "%s: start\n", __func__);
		data->connect_state = 0;
		stm32_keyboard_connect(data);
	}
		
}

static void stm32_bus_voting_work(struct work_struct *work)
{
	struct stm32_dev *data = container_of((struct delayed_work *)work,
			struct stm32_dev, bus_voting_work);
	int ret = 0;

	input_info(true, &data->client->dev, "%s: voting NONE\n", __func__);
	if (data->stm32_bus_perf_client) {
		if (data->voting_flag == STM32_BUS_VOTING_UP) {
			ret = msm_bus_scale_client_update_request(data->stm32_bus_perf_client, STM32_BUS_VOTING_NONE);
			if (ret) {
				input_info(true, &data->client->dev, "%s: voting failed ret:%d\n", __func__, ret);
			} else {
				data->voting_flag = STM32_BUS_VOTING_NONE;
			}
		}
	}
}

static irqreturn_t stm32_conn_isr(int irq, void *dev_id)
{
	struct stm32_dev *data = (struct stm32_dev *)dev_id;
#ifdef CONFIG_PM_SLEEP
	int ret = 0;

	wake_lock_timeout(&data->stm_wake_lock, msecs_to_jiffies(3 * MSEC_PER_SEC));
	if (!data->resume_done.done) {
		/* waiting for blsp block resuming, if not occurs i2c error */
		ret = wait_for_completion_interruptible_timeout(&data->resume_done,
				msecs_to_jiffies(5 * MSEC_PER_SEC));
		if (ret == 0) {
			input_err(true, &data->client->dev,
					"%s: LPM: pm resume is not handled [timeout]\n",
					__func__);
			return IRQ_HANDLED;
		}
	}
#endif
	cancel_delayed_work_sync(&data->check_conn_work);
	input_info(true, &data->client->dev,"%s\n", __func__);
	if (!gpio_get_value(data->dtdata->gpio_conn)) {
		stm32_dev_regulator(data, 0);
		schedule_delayed_work(&data->check_conn_work, msecs_to_jiffies(250));
	} else {
		schedule_work(&data->check_conn_work.work);
	}

	return IRQ_HANDLED;
}

static ssize_t keyboard_connected_store(struct device *dev,
		struct device_attribute *attr, const char *buf,
		size_t size)
{
	struct stm32_dev *data = dev_get_drvdata(dev);
	int onoff, err;

	if (strlen(buf) > 2) {
		input_err(true, &data->client->dev, "%s: cmd lenth is over %d\n",
				__func__, (int)strlen(buf));
		return -EINVAL;
	}

	err = kstrtoint(buf, 10, &onoff);
	if (err)
		return err;

	if (data->connect_state == !!onoff)
		return size;

	data->connect_state = !!onoff;
	input_info(true, &data->client->dev, "%s: current %d \n",
			__func__, data->connect_state);
	stm32_keyboard_connect(data);
	
	return size;
}

static ssize_t keyboard_connected_show(struct device *dev,
		struct device_attribute *attr, char *buf)
{
	struct stm32_dev *data = dev_get_drvdata(dev);

	input_info(true, dev, "%s: %d\n", __func__, data->connect_state);

	return snprintf(buf, 5, "%d\n", data->connect_state);
}

static ssize_t hw_reset_show(struct device *dev,
		struct device_attribute *attr, char *buf)
{
	struct stm32_dev *data = dev_get_drvdata(dev);

	input_info(true, dev, "%s \n", __func__);
	gpio_direction_output(data->dtdata->mcu_nrst, 0);
	stm32_delay(3);
	gpio_direction_output(data->dtdata->mcu_nrst, 1);

	return snprintf(buf, 5, "%d\n", data->dtdata->mcu_nrst);
}

static ssize_t pogo_get_fw_ver_ic(struct device *dev,
		struct device_attribute *attr, char *buf)
{
	struct stm32_dev *stm32 = dev_get_drvdata(dev);
	char buff[256] = { 0 };

	if (stm32->hall_closed || !stm32->connect_state)
		return snprintf(buf, 3, "NG");

	snprintf(buff, sizeof(buff), "%s_v%d.%d.%d.%d",
			stm32->dtdata->model_name,
			stm32->ic_fw_ver.fw_major_ver,
			stm32->ic_fw_ver.fw_minor_ver,
			stm32->ic_fw_ver.model_id,
			stm32->ic_fw_ver.hw_rev);

	input_info(true, &stm32->client->dev, "%s: %s\n", __func__, buff);
	return snprintf(buf, sizeof(buff), "%s", buff);
}

static ssize_t pogo_get_fw_ver_bin(struct device *dev,
		struct device_attribute *attr, char *buf)
{
	struct stm32_dev *stm32 = dev_get_drvdata(dev);
	char buff[256] = { 0 };

	if (stm32_load_fw_from_fota(stm32, ID_MCU) < 0) {
		input_err(true, &stm32->client->dev, "%s: failed to read bin data\n", __func__);
		return snprintf(buf, sizeof(buff), "NG");
	}

	snprintf(buff, sizeof(buff), "%s_v%d.%d.%d.%d",
			stm32->dtdata->model_name,
			stm32->fw_header->boot_app_ver.fw_major_ver,
			stm32->fw_header->boot_app_ver.fw_minor_ver,
			stm32->fw_header->boot_app_ver.model_id,
			stm32->fw_header->boot_app_ver.hw_rev);

	input_info(true, &stm32->client->dev, "%s: %s\n", __func__, buff);
	return snprintf(buf, sizeof(buff), "%s", buff);
}

static ssize_t pogo_get_crc(struct device *dev,
		struct device_attribute *attr, char *buf)
{
	struct stm32_dev *stm32 = dev_get_drvdata(dev);
	char buff[256] = { 0 };

	if (stm32->hall_closed || !stm32->connect_state)
		return snprintf(buf, 3, "NG");

