Svirusx/Nethunter-Kernel-S20_FE_5G/drivers/input/keyboard/stm/stm32l0/stm32_pogo_i2c.c
	return snprintf(buf, 5, "%d\n", stm32->debug_level);
}

#ifndef CONFIG_SAMSUNG_PRODUCT_SHIP
static ssize_t pogo_i2c_write(struct device *dev,
		struct device_attribute *attr, const char *buf,
		size_t size)
{
	struct stm32_dev *stm32 = dev_get_drvdata(dev);
	int ret, reg;

	ret = kstrtoint(buf, 0, &reg);
	if (ret)
		return ret;

	if (reg > 0xFF)
		return -EIO;

	ret = stm32_i2c_reg_write(stm32->client, ID_MCU, reg);

	input_info(true, &stm32->client->dev, "%s: write 0x%02X, ret: %d\n", __func__, reg, ret);
	return size;
}

static ssize_t pogo_i2c_read(struct device *dev,
		struct device_attribute *attr, const char *buf,
		size_t size)
{
	struct stm32_dev *stm32 = dev_get_drvdata(dev);
	int ret, reg;
	u8 buff[256] = { 0 };

	ret = kstrtoint(buf, 0, &reg);
	if (ret)
		return ret;

	if (reg > 0xFF)
		return -EIO;

	ret = stm32_i2c_reg_read(stm32->client, ID_MCU, reg, 255, buff);

	input_info(true, &stm32->client->dev, "%s: read 0x%02X, ret: %d\n", __func__, reg, ret);
	return size;
}
#endif

static ssize_t pogo_get_tc_fw_ver_bin(struct device *dev,
		struct device_attribute *attr, char *buf)
{
	struct stm32_dev *stm32 = dev_get_drvdata(dev);
	char buff[256] = { 0 };

	if (stm32_load_fw_from_fota(stm32, ID_TOUCHPAD) < 0) {
		input_err(true, &stm32->client->dev, "%s: failed to read bin data\n", __func__);
		return snprintf(buf, sizeof(buff), "NG");
	}

	snprintf(buff, sizeof(buff), "%s-TC_v%02X%02X",
			stm32->dtdata->model_name,
			stm32->tc_fw_ver_of_bin.major_ver & 0xFF,
			stm32->tc_fw_ver_of_bin.minor_ver & 0xFF);

	input_info(true, &stm32->client->dev, "%s: %s\n", __func__, buff);
	return snprintf(buf, sizeof(buff), "%s", buff);
}

static ssize_t pogo_get_tc_fw_ver_ic(struct device *dev,
		struct device_attribute *attr, char *buf)
{
	struct stm32_dev *stm32 = dev_get_drvdata(dev);
	char buff[256] = { 0 };

	mutex_lock(&stm32->dev_lock);

	if (stm32->hall_closed || !stm32->connect_state)
		goto NG;

	if (stm32->tc_crc == STM32_TC_CRC_OK)
		snprintf(buff, sizeof(buff), "%s-TC_v%02X%02X",
				stm32->dtdata->model_name,
				stm32->tc_fw_ver_of_ic.major_ver & 0xFF,
				stm32->tc_fw_ver_of_ic.minor_ver & 0xFF);
	else
		snprintf(buff, sizeof(buff), "%s-TC_v0000",
				stm32->dtdata->model_name);

	input_info(true, &stm32->client->dev, "%s: %s\n", __func__, buff);
	mutex_unlock(&stm32->dev_lock);

	return snprintf(buf, sizeof(buff), "%s", buff);

NG:
	snprintf(buff, sizeof(buff), "NG");

	input_info(true, &stm32->client->dev, "%s: %s\n", __func__, buff);
	mutex_unlock(&stm32->dev_lock);

	return snprintf(buf, sizeof(buff), "%s", buff);
}

static ssize_t pogo_get_tc_crc(struct device *dev,
		struct device_attribute *attr, char *buf)
{
	struct stm32_dev *stm32 = dev_get_drvdata(dev);
	char buff[256] = { 0 };

	if (stm32->hall_closed || !stm32->connect_state)
		return snprintf(buf, 3, "NG");

	snprintf(buff, sizeof(buff), "%04X", stm32->tc_crc);

	input_info(true, &stm32->client->dev, "%s: %s\n", __func__, buff);
	return snprintf(buf, sizeof(buff), "%s", buff);
}

static int stm32_tc_fw_update(struct stm32_dev *stm32)
{
	int ret;
	u8 buff[3] = { 0 };
	u16 page_size;

	ret = stm32_set_mode(stm32, MODE_DFU);
	if (ret < 0) {
		input_err(true, &stm32->client->dev,
				"%s: failed to set DFU mode\n", __func__);
		return ret;
	}

	stm32_enable_irq(stm32, INT_DISABLE_SYNC);

	stm32_delay(1000);

	ret = stm32_read_version(stm32);
	if (ret < 0)
		goto out;

	ret = stm32_read_tc_version(stm32);
	if (ret < 0)
		goto out;

	ret = stm32_read_tc_crc(stm32);
	if (ret < 0)
		goto out;

	ret = stm32_i2c_reg_read(stm32->client, ID_TOUCHPAD, STM32_CMD_GET_PAGE_SIZE, 2, buff);
	if (ret < 0)
		goto out;

	memcpy(&page_size, &buff[0], 2);

	ret = stm32_i2c_reg_write(stm32->client, ID_TOUCHPAD, STM32_CMD_START_FW_UPGRADE);
	if (ret < 0)
		goto out;

	stm32_delay(800);

	ret = stm32_i2c_read_bulk(stm32->client, buff, 3);
	if (ret < 0)
		goto out;

	ret = stm32_i2c_read_bulk(stm32->client, buff, 1);
	if (ret < 0 || buff[0] != TC_FW_RES_OK) {
		ret = -EIO;
		input_err(true, &stm32->client->dev,
				"%s: tc fw update cmd is failed, 0x%02X\n", __func__, buff[0]);
		goto out;
	}

	input_info(true, &stm32->client->dev, "%s: start to update\n", __func__);

	mutex_lock(&stm32->i2c_lock);
	ret = stm32_write_fw(stm32, ID_TOUCHPAD, page_size);
	mutex_unlock(&stm32->i2c_lock);
	if (ret < 0)
		goto out;

	/* check fw version & crc of touch controller */
	ret = stm32_read_tc_version(stm32);
	if (ret < 0)
		goto out;

	ret = stm32_read_tc_crc(stm32);
	if (ret < 0)
		goto out;

	if (stm32->tc_crc != STM32_TC_CRC_OK) {
		ret = -EIO;
		input_err(true, &stm32->client->dev, "%s: CRC mismatch!\n", __func__);
		goto out;
	}

out:
	if (stm32_i2c_reg_write(stm32->client, ID_MCU, STM32_CMD_ABORT) < 0)
		return -EIO;

	input_info(true, &stm32->client->dev,
			"%s: [APP MODE] Start with boot bank\n", __func__);

	if (stm32->connect_state)
		stm32_enable_irq(stm32, INT_ENABLE);

	return ret;
}

static ssize_t pogo_fw_update(struct device *dev,
		struct device_attribute *attr, const char *buf,
		size_t size)
{
	struct stm32_dev *stm32 = dev_get_drvdata(dev);
	int ret, param;

	if (stm32->hall_closed || !stm32->connect_state)
		return -ENODEV;

	ret = kstrtoint(buf, 10, &param);
	if (ret)
		return ret;

	input_info(true, &stm32->client->dev, "%s \n", __func__);

	switch (param) {
	case FW_UPDATE_MCU:
		ret = stm32_load_fw_from_fota(stm32, ID_MCU);
		if (ret < 0)
			return ret;

		ret = stm32_fw_update(stm32);
		if (ret < 0)
			return ret;
		else
			return size;
	case FW_UPDATE_TC:
		ret = stm32_load_fw_from_fota(stm32, ID_TOUCHPAD);
		if (ret < 0)
			return ret;
	
		ret = stm32_tc_fw_update(stm32);
		if (ret < 0)
			return ret;
		else
			return size;
	default:
		return -EINVAL;
	}
}

static ssize_t stm32_dev_fw_update(struct device *dev,
		struct device_attribute *attr, char *buf)
{
	struct stm32_dev *stm32 = dev_get_drvdata(dev);
	int ret;
	
	ret = stm32_dev_firmware_update_menu(stm32, 1);

	if (!ret)
		return snprintf(buf, 3, "OK");
	else
		return snprintf(buf, 3, "NG");
}

static ssize_t get_mcu_fw_ver(struct device *dev,
		struct device_attribute *attr, char *buf)
{
	struct stm32_dev *stm32 = dev_get_drvdata(dev);
	int ret = 0;

	if (stm32->connect_state)
		return snprintf(buf, 3, "NG");

