Svirusx/Nethunter-Kernel-S20_FE_5G/drivers/input/keyboard/stm/stm32l0/stm32_pogo_i2c.c
	ret = stm32_dev_get_ic_ver(stm32);
	if (ret < 0)
		return snprintf(buf, 3, "NG");

	if (stm32->mdata.phone_ver[3] == stm32->mdata.ic_ver[3])
		return snprintf(buf, 3, "%2x", stm32->mdata.ic_ver[3]);
	else
		return snprintf(buf, 3, "NG");
}

static DEVICE_ATTR(keyboard_connected, 0644, keyboard_connected_show, keyboard_connected_store);
static DEVICE_ATTR(hw_reset, 0444, hw_reset_show, NULL);
static DEVICE_ATTR(get_fw_ver_bin, 0444, pogo_get_fw_ver_bin, NULL);
static DEVICE_ATTR(get_fw_ver_ic, 0444, pogo_get_fw_ver_ic, NULL);
static DEVICE_ATTR(get_crc, 0444, pogo_get_crc, NULL);
static DEVICE_ATTR(check_fw_update, 0444, pogo_check_fw_update, NULL);
static DEVICE_ATTR(fw_update, 0220, NULL, pogo_fw_update);
static DEVICE_ATTR(fw_mcu_update, 0444, stm32_dev_fw_update, NULL);
static DEVICE_ATTR(debug, 0644, pogo_debug_level_show, pogo_debug_level_store);
#ifndef CONFIG_SAMSUNG_PRODUCT_SHIP
static DEVICE_ATTR(write_cmd, 0200, NULL, pogo_i2c_write);
static DEVICE_ATTR(read_cmd, 0200, NULL, pogo_i2c_read);
#endif
static DEVICE_ATTR(get_tc_fw_ver_bin, 0444, pogo_get_tc_fw_ver_bin, NULL);
static DEVICE_ATTR(get_tc_fw_ver_ic, 0444, pogo_get_tc_fw_ver_ic, NULL);
static DEVICE_ATTR(get_tc_crc, 0444, pogo_get_tc_crc, NULL);
static DEVICE_ATTR(get_mcu_fw_ver, 0444, get_mcu_fw_ver, NULL);


static struct attribute *key_attributes[] = {
	&dev_attr_keyboard_connected.attr,
	&dev_attr_hw_reset.attr,
	&dev_attr_get_fw_ver_bin.attr,
	&dev_attr_get_fw_ver_ic.attr,
	&dev_attr_get_crc.attr,
	&dev_attr_check_fw_update.attr,
	&dev_attr_fw_update.attr,
	&dev_attr_fw_mcu_update.attr,
	&dev_attr_debug.attr,
#ifndef CONFIG_SAMSUNG_PRODUCT_SHIP
	&dev_attr_write_cmd.attr,
	&dev_attr_read_cmd.attr,
#endif
	&dev_attr_get_tc_fw_ver_bin.attr,
	&dev_attr_get_tc_fw_ver_ic.attr,
	&dev_attr_get_tc_crc.attr,
	&dev_attr_get_mcu_fw_ver.attr,
	NULL,
};

static struct attribute_group key_attr_group = {
	.attrs = key_attributes,
};

static int stm32_dev_probe(struct i2c_client *client,
		const struct i2c_device_id *id)
{
	struct stm32_dev *device_data;
	int ret = 0;
	u16 boot_addr = 0x51;

	input_info(true, &client->dev, "%s++\n", __func__);

	if (!i2c_check_functionality(client->adapter, I2C_FUNC_I2C)) {
		input_err(true, &client->dev,
				"i2c_check_functionality fail\n");
		return -EIO;
	}

	device_data = kzalloc(sizeof(struct stm32_dev), GFP_KERNEL);
	if (!device_data) {
		input_err(true, &client->dev, "Failed to allocate memory\n");
		return -ENOMEM;
	}

	device_data->client_boot = i2c_new_dummy(client->adapter, boot_addr);
	if (!device_data->client_boot) {
		input_err(true, &client->dev,
				"Failed to register sub client[0x%x]\n", boot_addr);
		kfree(device_data);
		return -ENOMEM;
	}

	mutex_init(&device_data->dev_lock);
	mutex_init(&device_data->irq_lock);
	mutex_init(&device_data->i2c_lock);
	mutex_init(&device_data->conn_lock);
	wake_lock_init(&device_data->stm_wake_lock, WAKE_LOCK_SUSPEND, "stm_key wake lock");
#ifdef CONFIG_PM_SLEEP
	init_completion(&device_data->resume_done);
	complete_all(&device_data->resume_done);
#endif
	init_completion(&device_data->i2c_done);
	complete_all(&device_data->i2c_done);
	device_data->client = client;

	if (client->dev.of_node) {
		device_data->dtdata = devm_kzalloc(&client->dev,
				sizeof(struct stm32_devicetree_data), GFP_KERNEL);
		if (!device_data->dtdata) {
			input_err(true, &client->dev, "Failed to allocate memory\n");
			ret = -ENOMEM;
			goto err_config;
		}
		ret = stm32_parse_dt(&client->dev, device_data);
		if (ret) {
			input_err(true, &client->dev, "Failed to use device tree\n");
			ret = -EIO;
			goto err_config;
		}

	} else {
		input_err(true, &client->dev, "No use device tree\n");
		device_data->dtdata = client->dev.platform_data;
		if (!device_data->dtdata) {
			input_err(true, &client->dev, "Failed to get platform data\n");
			ret = -ENOENT;
			goto err_config;
		}
	}

	/* Get pinctrl if target uses pinctrl */
	device_data->pinctrl = devm_pinctrl_get(&client->dev);
	if (IS_ERR(device_data->pinctrl)) {
		if (PTR_ERR(device_data->pinctrl) == -EPROBE_DEFER) {
			ret = PTR_ERR(device_data->pinctrl);
			goto err_config;
		}

		input_err(true, &client->dev, "%s: Target does not use pinctrl\n", __func__);
		device_data->pinctrl = NULL;
	}

	device_data->fw_header = kzalloc(sizeof(struct stm32_fw_header), GFP_KERNEL);
	if (!device_data->fw_header) {
		input_err(true, &client->dev, "fw header kzalloc memory error\n");
		ret = -ENOMEM;
		goto err_alloc_fw_header;
	}

	device_data->fw = kzalloc(sizeof(struct firmware), GFP_KERNEL);
	if (!device_data->fw) {
		ret = -ENOMEM;
		goto err_alloc_fw;
	}

	device_data->fw->data = kzalloc(STM32_FW_SIZE, GFP_KERNEL);
	if (!device_data->fw->data) {
		ret = -ENOMEM;
		goto err_alloc_fw_data;
	}

	device_data->tc_fw = kzalloc(sizeof(struct firmware), GFP_KERNEL);
	if (!device_data->tc_fw) {
		ret = -ENOMEM;
		goto err_alloc_tc_fw;
	}

	device_data->tc_fw->data = kzalloc(STM32_FW_SIZE, GFP_KERNEL);
	if (!device_data->tc_fw->data) {
		ret = -ENOMEM;
		goto err_alloc_tc_fw_data;
	}

	i2c_set_clientdata(client, device_data);
	i2c_set_clientdata(device_data->client_boot, device_data);
	g_tc_resolution.x = 0;
	g_tc_resolution.y = 0;
	device_data->check_ic_flag = false;

	device_data->dev_irq = gpio_to_irq(device_data->dtdata->gpio_int);
	input_info(true, &client->dev,
			"%s INT mode (%d)\n", __func__, device_data->dev_irq);

	device_data->conn_irq = gpio_to_irq(device_data->dtdata->gpio_conn);
	input_info(true, &client->dev,
			"%s CONN INT PIN (%d)\n", __func__, device_data->conn_irq);

	ret = stm32_dev_firmware_update_menu(device_data, 0);
	if (ret < 0)
		input_err(true, &client->dev, "Failed to update stm32_mcu_dev firmware %d\n", ret);

	ret = request_threaded_irq(device_data->dev_irq, NULL, stm32_dev_isr,
					device_data->dtdata->irq_type,
					STM32_DRV_NAME, device_data);
	if (ret < 0) {
		input_err(true, &client->dev, "stm32_dev_irq request error %d\n", ret);
		goto err_firmware_update;
	}

	ret = request_threaded_irq(device_data->conn_irq, NULL, stm32_conn_isr,
					device_data->dtdata->irq_conn_type,
					STM32_DRV_CONN_NAME, device_data);
	if (ret < 0) {
		input_err(true, &client->dev, "stm32_dev_conn_isr request error %d\n", ret);
		goto interrupt_err;
	}

	enable_irq_wake(device_data->conn_irq);
	stm32_enable_irq(device_data, INT_DISABLE_NOSYNC);

	device_data->stm32_bus_scale_table = msm_bus_cl_get_pdata_from_dev(&client->dev);
	if (device_data->stm32_bus_scale_table) {
		device_data->stm32_bus_perf_client = msm_bus_scale_register_client(device_data->stm32_bus_scale_table);
		input_info(true, &client->dev, "%s request success bus_scale:%d\n", __func__, device_data->stm32_bus_perf_client);
		device_data->voting_flag = STM32_BUS_VOTING_NONE;
	} else {
		input_info(true, &client->dev, "%s msm_bus_cl_get_pdata failed\n", __func__);
	}

	device_data->sec_pogo = sec_device_create(device_data, "sec_keypad");

	if (IS_ERR(device_data->sec_pogo)) {
		input_err(true, &client->dev, "Failed to create sec_keypad device\n");
		ret = PTR_ERR(device_data->sec_pogo);
		goto err_create_device;
	}

