Svirusx/Nethunter-Kernel-S20_FE_5G/drivers/input/keyboard/stm/stm32l0/stm32_pogo_i2c.c
	ret = sysfs_create_group(&device_data->sec_pogo->kobj, &key_attr_group);
	if (ret) {
		input_err(true, &client->dev, "Failed to create sysfs: %d\n", ret);
		goto err_create_group;
	}

	device_init_wakeup(&client->dev, 1);

	BLOCKING_INIT_NOTIFIER_HEAD(&pogo_notifier.pogo_notifier_call_chain);

	INIT_DELAYED_WORK(&device_data->check_ic_work, stm32_check_ic_work);
	INIT_DELAYED_WORK(&device_data->print_info_work, stm32_print_info_work);
	INIT_DELAYED_WORK(&device_data->check_conn_work, stm32_check_conn_work);
	INIT_DELAYED_WORK(&device_data->check_init_work, stm32_check_init_work);
	if (device_data->stm32_bus_perf_client)
		INIT_DELAYED_WORK(&device_data->bus_voting_work, stm32_bus_voting_work);

	device_data->connect_state = gpio_get_value(device_data->dtdata->gpio_conn);
	if (device_data->connect_state)
		device_data->check_ic_flag = true;
	else
		device_data->check_ic_flag = false;
	stm32_keyboard_connect(device_data);

	input_info(true, &client->dev, "%s done\n", __func__);

	return ret;

	//sysfs_remove_group(&device_data->sec_pogo->kobj, &key_attr_group);
err_create_group:
	sec_device_destroy(15);
err_create_device:
	if (device_data->stm32_bus_perf_client)
		msm_bus_scale_unregister_client(device_data->stm32_bus_perf_client);
interrupt_err:
err_firmware_update:
	i2c_unregister_device(client);
	i2c_unregister_device(device_data->client_boot);
	kfree(device_data->tc_fw->data);
err_alloc_tc_fw_data:
	kfree(device_data->tc_fw);
err_alloc_tc_fw:
	kfree(device_data->fw->data);
err_alloc_fw_data:
	kfree(device_data->fw);
err_alloc_fw:
	kfree(device_data->fw_header);
err_alloc_fw_header:
err_config:
	mutex_destroy(&device_data->dev_lock);
	mutex_destroy(&device_data->irq_lock);
	mutex_destroy(&device_data->i2c_lock);
	mutex_destroy(&device_data->conn_lock);

	wake_lock_destroy(&device_data->stm_wake_lock);

	kfree(device_data);

	input_err(true, &client->dev, "Error at %s\n", __func__);

	return ret;
}

static int stm32_dev_remove(struct i2c_client *client)
{
	struct stm32_dev *device_data = i2c_get_clientdata(client);

	input_info(true, &client->dev, "%s\n", __func__);

	cancel_delayed_work_sync(&device_data->print_info_work);
	cancel_delayed_work_sync(&device_data->check_ic_work);
	cancel_delayed_work_sync(&device_data->check_conn_work);
	cancel_delayed_work_sync(&device_data->check_init_work);

	if (device_data->stm32_bus_perf_client) {
		cancel_delayed_work_sync(&device_data->bus_voting_work);
		stm32_bus_voting_work(&device_data->bus_voting_work.work);
		msm_bus_scale_unregister_client(device_data->stm32_bus_perf_client);
	}

	device_init_wakeup(&client->dev, 0);
	wake_lock_destroy(&device_data->stm_wake_lock);

	stm32_dev_regulator(device_data, 0);

	i2c_unregister_device(device_data->client_boot);

	free_irq(device_data->dev_irq, device_data);
	free_irq(device_data->conn_irq, device_data);
	sec_device_destroy(14);

	kfree(device_data->tc_fw->data);
	kfree(device_data->tc_fw);
	kfree(device_data->fw->data);
	kfree(device_data->fw);
	kfree(device_data->fw_header);
	kfree(device_data);

	return 0;
}

#ifdef CONFIG_PM_SLEEP
static int stm32_dev_suspend(struct device *dev)
{
	struct stm32_dev *device_data = dev_get_drvdata(dev);
	int ret = 0;

	input_dbg(false, &device_data->client->dev, "%s\n", __func__);

	ret = wait_for_completion_interruptible_timeout(&device_data->i2c_done,
				msecs_to_jiffies(3 * MSEC_PER_SEC));
	if (ret <= 0) {
		input_err(true, &device_data->client->dev,
				"%s: i2c is not handled, error %d\n",
				__func__, ret);
	}

	if (device_data->stm32_bus_perf_client) {
		cancel_delayed_work(&device_data->bus_voting_work);
		stm32_bus_voting_work(&device_data->bus_voting_work.work);
	}

	cancel_delayed_work(&device_data->print_info_work);

	reinit_completion(&device_data->resume_done);

	if (device_data->connect_state && device_may_wakeup(dev)) {
		enable_irq_wake(device_data->dev_irq);
		device_data->irq_wake = true;
		input_info(false, &device_data->client->dev,
				"%s enable irq wake\n", __func__);
	}

	return 0;
}

static int stm32_dev_resume(struct device *dev)
{
	struct stm32_dev *device_data = dev_get_drvdata(dev);

	input_dbg(false, &device_data->client->dev, "%s\n", __func__);

	complete_all(&device_data->resume_done);

	if (device_data->irq_wake && device_may_wakeup(dev)) {
		disable_irq_wake(device_data->dev_irq);
		device_data->irq_wake = false;
		input_info(false, &device_data->client->dev,
				"%s disable irq wake\n", __func__);
	}
	if (device_data->connect_state)
		schedule_delayed_work(&device_data->print_info_work, STM32_PRINT_INFO_DELAY);

	return 0;
}

static SIMPLE_DEV_PM_OPS(stm32_dev_pm_ops,
		stm32_dev_suspend, stm32_dev_resume);
#endif

static const struct i2c_device_id stm32_dev_id[] = {
	{ STM32_DRV_NAME, 0 },
	{ }
};

#ifdef CONFIG_OF
static struct of_device_id stm32_match_table[] = {
	{ .compatible = "stm,stm32_pogo",},
	{ },
};
#else
#define stm32_match_table NULL
#endif

static struct i2c_driver stm32_dev_driver = {
	.driver = {
		.name = STM32_DRV_NAME,
		.owner = THIS_MODULE,
		.of_match_table = stm32_match_table,
#ifdef CONFIG_PM_SLEEP
		.pm = &stm32_dev_pm_ops,
#endif
	},
	.probe = stm32_dev_probe,
	.remove = stm32_dev_remove,
	.id_table = stm32_dev_id,
};

static int __init stm32_dev_init(void)
{
	pr_err("%s++\n", __func__);

	return i2c_add_driver(&stm32_dev_driver);
}
static void __exit stm32_dev_exit(void)
{
	i2c_del_driver(&stm32_dev_driver);
}
module_init(stm32_dev_init);
//late_initcall(stm32_dev_init);
module_exit(stm32_dev_exit);

MODULE_DEVICE_TABLE(i2c, stm32_dev_id);

MODULE_DESCRIPTION("STM32 POGO I2C Driver");
MODULE_AUTHOR("Samsung");
MODULE_LICENSE("GPL");
